Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/include/component/i2s.h
#define I2S_RXCTRL_SERMODE_Pos                _U_(0)                                               /**< (I2S_RXCTRL) Serializer Mode Position */
#define I2S_RXCTRL_SERMODE_Msk                (_U_(0x3) << I2S_RXCTRL_SERMODE_Pos)                 /**< (I2S_RXCTRL) Serializer Mode Mask */
#define I2S_RXCTRL_SERMODE(value)             (I2S_RXCTRL_SERMODE_Msk & ((value) << I2S_RXCTRL_SERMODE_Pos))
#define   I2S_RXCTRL_SERMODE_RX_Val           _U_(0x0)                                             /**< (I2S_RXCTRL) Receive  */
#define   I2S_RXCTRL_SERMODE_PDM2_Val         _U_(0x2)                                             /**< (I2S_RXCTRL) Receive one PDM data on each serial clock edge  */
#define I2S_RXCTRL_SERMODE_RX                 (I2S_RXCTRL_SERMODE_RX_Val << I2S_RXCTRL_SERMODE_Pos) /**< (I2S_RXCTRL) Receive Position  */
#define I2S_RXCTRL_SERMODE_PDM2               (I2S_RXCTRL_SERMODE_PDM2_Val << I2S_RXCTRL_SERMODE_Pos) /**< (I2S_RXCTRL) Receive one PDM data on each serial clock edge Position  */
#define I2S_RXCTRL_CLKSEL_Pos                 _U_(5)                                               /**< (I2S_RXCTRL) Clock Unit Selection Position */
#define I2S_RXCTRL_CLKSEL_Msk                 (_U_(0x1) << I2S_RXCTRL_CLKSEL_Pos)                  /**< (I2S_RXCTRL) Clock Unit Selection Mask */
#define I2S_RXCTRL_CLKSEL(value)              (I2S_RXCTRL_CLKSEL_Msk & ((value) << I2S_RXCTRL_CLKSEL_Pos))
#define   I2S_RXCTRL_CLKSEL_CLK0_Val          _U_(0x0)                                             /**< (I2S_RXCTRL) Use Clock Unit 0  */
#define   I2S_RXCTRL_CLKSEL_CLK1_Val          _U_(0x1)                                             /**< (I2S_RXCTRL) Use Clock Unit 1  */
#define I2S_RXCTRL_CLKSEL_CLK0                (I2S_RXCTRL_CLKSEL_CLK0_Val << I2S_RXCTRL_CLKSEL_Pos) /**< (I2S_RXCTRL) Use Clock Unit 0 Position  */
#define I2S_RXCTRL_CLKSEL_CLK1                (I2S_RXCTRL_CLKSEL_CLK1_Val << I2S_RXCTRL_CLKSEL_Pos) /**< (I2S_RXCTRL) Use Clock Unit 1 Position  */
#define I2S_RXCTRL_SLOTADJ_Pos                _U_(7)                                               /**< (I2S_RXCTRL) Data Slot Formatting Adjust Position */
#define I2S_RXCTRL_SLOTADJ_Msk                (_U_(0x1) << I2S_RXCTRL_SLOTADJ_Pos)                 /**< (I2S_RXCTRL) Data Slot Formatting Adjust Mask */
#define I2S_RXCTRL_SLOTADJ(value)             (I2S_RXCTRL_SLOTADJ_Msk & ((value) << I2S_RXCTRL_SLOTADJ_Pos))
#define   I2S_RXCTRL_SLOTADJ_RIGHT_Val        _U_(0x0)                                             /**< (I2S_RXCTRL) Data is right adjusted in slot  */
#define   I2S_RXCTRL_SLOTADJ_LEFT_Val         _U_(0x1)                                             /**< (I2S_RXCTRL) Data is left adjusted in slot  */
#define I2S_RXCTRL_SLOTADJ_RIGHT              (I2S_RXCTRL_SLOTADJ_RIGHT_Val << I2S_RXCTRL_SLOTADJ_Pos) /**< (I2S_RXCTRL) Data is right adjusted in slot Position  */
#define I2S_RXCTRL_SLOTADJ_LEFT               (I2S_RXCTRL_SLOTADJ_LEFT_Val << I2S_RXCTRL_SLOTADJ_Pos) /**< (I2S_RXCTRL) Data is left adjusted in slot Position  */
#define I2S_RXCTRL_DATASIZE_Pos               _U_(8)                                               /**< (I2S_RXCTRL) Data Word Size Position */
#define I2S_RXCTRL_DATASIZE_Msk               (_U_(0x7) << I2S_RXCTRL_DATASIZE_Pos)                /**< (I2S_RXCTRL) Data Word Size Mask */
#define I2S_RXCTRL_DATASIZE(value)            (I2S_RXCTRL_DATASIZE_Msk & ((value) << I2S_RXCTRL_DATASIZE_Pos))
#define   I2S_RXCTRL_DATASIZE_32_Val          _U_(0x0)                                             /**< (I2S_RXCTRL) 32 bits  */
#define   I2S_RXCTRL_DATASIZE_24_Val          _U_(0x1)                                             /**< (I2S_RXCTRL) 24 bits  */
#define   I2S_RXCTRL_DATASIZE_20_Val          _U_(0x2)                                             /**< (I2S_RXCTRL) 20 bits  */
#define   I2S_RXCTRL_DATASIZE_18_Val          _U_(0x3)                                             /**< (I2S_RXCTRL) 18 bits  */
#define   I2S_RXCTRL_DATASIZE_16_Val          _U_(0x4)                                             /**< (I2S_RXCTRL) 16 bits  */
#define   I2S_RXCTRL_DATASIZE_16C_Val         _U_(0x5)                                             /**< (I2S_RXCTRL) 16 bits compact stereo  */
#define   I2S_RXCTRL_DATASIZE_8_Val           _U_(0x6)                                             /**< (I2S_RXCTRL) 8 bits  */
#define   I2S_RXCTRL_DATASIZE_8C_Val          _U_(0x7)                                             /**< (I2S_RXCTRL) 8 bits compact stereo  */
#define I2S_RXCTRL_DATASIZE_32                (I2S_RXCTRL_DATASIZE_32_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 32 bits Position  */
#define I2S_RXCTRL_DATASIZE_24                (I2S_RXCTRL_DATASIZE_24_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 24 bits Position  */
#define I2S_RXCTRL_DATASIZE_20                (I2S_RXCTRL_DATASIZE_20_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 20 bits Position  */
#define I2S_RXCTRL_DATASIZE_18                (I2S_RXCTRL_DATASIZE_18_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 18 bits Position  */
#define I2S_RXCTRL_DATASIZE_16                (I2S_RXCTRL_DATASIZE_16_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 16 bits Position  */
#define I2S_RXCTRL_DATASIZE_16C               (I2S_RXCTRL_DATASIZE_16C_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 16 bits compact stereo Position  */
#define I2S_RXCTRL_DATASIZE_8                 (I2S_RXCTRL_DATASIZE_8_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 8 bits Position  */
#define I2S_RXCTRL_DATASIZE_8C                (I2S_RXCTRL_DATASIZE_8C_Val << I2S_RXCTRL_DATASIZE_Pos) /**< (I2S_RXCTRL) 8 bits compact stereo Position  */
#define I2S_RXCTRL_WORDADJ_Pos                _U_(12)                                              /**< (I2S_RXCTRL) Data Word Formatting Adjust Position */
#define I2S_RXCTRL_WORDADJ_Msk                (_U_(0x1) << I2S_RXCTRL_WORDADJ_Pos)                 /**< (I2S_RXCTRL) Data Word Formatting Adjust Mask */
#define I2S_RXCTRL_WORDADJ(value)             (I2S_RXCTRL_WORDADJ_Msk & ((value) << I2S_RXCTRL_WORDADJ_Pos))
#define   I2S_RXCTRL_WORDADJ_RIGHT_Val        _U_(0x0)                                             /**< (I2S_RXCTRL) Data is right adjusted in word  */
#define   I2S_RXCTRL_WORDADJ_LEFT_Val         _U_(0x1)                                             /**< (I2S_RXCTRL) Data is left adjusted in word  */
#define I2S_RXCTRL_WORDADJ_RIGHT              (I2S_RXCTRL_WORDADJ_RIGHT_Val << I2S_RXCTRL_WORDADJ_Pos) /**< (I2S_RXCTRL) Data is right adjusted in word Position  */
#define I2S_RXCTRL_WORDADJ_LEFT               (I2S_RXCTRL_WORDADJ_LEFT_Val << I2S_RXCTRL_WORDADJ_Pos) /**< (I2S_RXCTRL) Data is left adjusted in word Position  */
#define I2S_RXCTRL_EXTEND_Pos                 _U_(13)                                              /**< (I2S_RXCTRL) Data Formatting Bit Extension Position */
#define I2S_RXCTRL_EXTEND_Msk                 (_U_(0x3) << I2S_RXCTRL_EXTEND_Pos)                  /**< (I2S_RXCTRL) Data Formatting Bit Extension Mask */
#define I2S_RXCTRL_EXTEND(value)              (I2S_RXCTRL_EXTEND_Msk & ((value) << I2S_RXCTRL_EXTEND_Pos))
#define   I2S_RXCTRL_EXTEND_ZERO_Val          _U_(0x0)                                             /**< (I2S_RXCTRL) Extend with zeroes  */
#define   I2S_RXCTRL_EXTEND_ONE_Val           _U_(0x1)                                             /**< (I2S_RXCTRL) Extend with ones  */
#define   I2S_RXCTRL_EXTEND_MSBIT_Val         _U_(0x2)                                             /**< (I2S_RXCTRL) Extend with Most Significant Bit  */
#define   I2S_RXCTRL_EXTEND_LSBIT_Val         _U_(0x3)                                             /**< (I2S_RXCTRL) Extend with Least Significant Bit  */
#define I2S_RXCTRL_EXTEND_ZERO                (I2S_RXCTRL_EXTEND_ZERO_Val << I2S_RXCTRL_EXTEND_Pos) /**< (I2S_RXCTRL) Extend with zeroes Position  */
#define I2S_RXCTRL_EXTEND_ONE                 (I2S_RXCTRL_EXTEND_ONE_Val << I2S_RXCTRL_EXTEND_Pos) /**< (I2S_RXCTRL) Extend with ones Position  */
#define I2S_RXCTRL_EXTEND_MSBIT               (I2S_RXCTRL_EXTEND_MSBIT_Val << I2S_RXCTRL_EXTEND_Pos) /**< (I2S_RXCTRL) Extend with Most Significant Bit Position  */
#define I2S_RXCTRL_EXTEND_LSBIT               (I2S_RXCTRL_EXTEND_LSBIT_Val << I2S_RXCTRL_EXTEND_Pos) /**< (I2S_RXCTRL) Extend with Least Significant Bit Position  */
#define I2S_RXCTRL_BITREV_Pos                 _U_(15)                                              /**< (I2S_RXCTRL) Data Formatting Bit Reverse Position */
#define I2S_RXCTRL_BITREV_Msk                 (_U_(0x1) << I2S_RXCTRL_BITREV_Pos)                  /**< (I2S_RXCTRL) Data Formatting Bit Reverse Mask */
#define I2S_RXCTRL_BITREV(value)              (I2S_RXCTRL_BITREV_Msk & ((value) << I2S_RXCTRL_BITREV_Pos))
#define   I2S_RXCTRL_BITREV_MSBIT_Val         _U_(0x0)                                             /**< (I2S_RXCTRL) Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)  */
#define   I2S_RXCTRL_BITREV_LSBIT_Val         _U_(0x1)                                             /**< (I2S_RXCTRL) Transfer Data Least Significant Bit (LSB) first  */
#define I2S_RXCTRL_BITREV_MSBIT               (I2S_RXCTRL_BITREV_MSBIT_Val << I2S_RXCTRL_BITREV_Pos) /**< (I2S_RXCTRL) Transfer Data Most Significant Bit (MSB) first (default for I2S protocol) Position  */
#define I2S_RXCTRL_BITREV_LSBIT               (I2S_RXCTRL_BITREV_LSBIT_Val << I2S_RXCTRL_BITREV_Pos) /**< (I2S_RXCTRL) Transfer Data Least Significant Bit (LSB) first Position  */
#define I2S_RXCTRL_SLOTDIS0_Pos               _U_(16)                                              /**< (I2S_RXCTRL) Slot 0 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS0_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS0_Pos)                /**< (I2S_RXCTRL) Slot 0 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS0(value)            (I2S_RXCTRL_SLOTDIS0_Msk & ((value) << I2S_RXCTRL_SLOTDIS0_Pos))
#define I2S_RXCTRL_SLOTDIS1_Pos               _U_(17)                                              /**< (I2S_RXCTRL) Slot 1 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS1_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS1_Pos)                /**< (I2S_RXCTRL) Slot 1 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS1(value)            (I2S_RXCTRL_SLOTDIS1_Msk & ((value) << I2S_RXCTRL_SLOTDIS1_Pos))
#define I2S_RXCTRL_SLOTDIS2_Pos               _U_(18)                                              /**< (I2S_RXCTRL) Slot 2 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS2_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS2_Pos)                /**< (I2S_RXCTRL) Slot 2 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS2(value)            (I2S_RXCTRL_SLOTDIS2_Msk & ((value) << I2S_RXCTRL_SLOTDIS2_Pos))
#define I2S_RXCTRL_SLOTDIS3_Pos               _U_(19)                                              /**< (I2S_RXCTRL) Slot 3 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS3_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS3_Pos)                /**< (I2S_RXCTRL) Slot 3 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS3(value)            (I2S_RXCTRL_SLOTDIS3_Msk & ((value) << I2S_RXCTRL_SLOTDIS3_Pos))
#define I2S_RXCTRL_SLOTDIS4_Pos               _U_(20)                                              /**< (I2S_RXCTRL) Slot 4 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS4_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS4_Pos)                /**< (I2S_RXCTRL) Slot 4 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS4(value)            (I2S_RXCTRL_SLOTDIS4_Msk & ((value) << I2S_RXCTRL_SLOTDIS4_Pos))
#define I2S_RXCTRL_SLOTDIS5_Pos               _U_(21)                                              /**< (I2S_RXCTRL) Slot 5 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS5_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS5_Pos)                /**< (I2S_RXCTRL) Slot 5 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS5(value)            (I2S_RXCTRL_SLOTDIS5_Msk & ((value) << I2S_RXCTRL_SLOTDIS5_Pos))
#define I2S_RXCTRL_SLOTDIS6_Pos               _U_(22)                                              /**< (I2S_RXCTRL) Slot 6 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS6_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS6_Pos)                /**< (I2S_RXCTRL) Slot 6 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS6(value)            (I2S_RXCTRL_SLOTDIS6_Msk & ((value) << I2S_RXCTRL_SLOTDIS6_Pos))
#define I2S_RXCTRL_SLOTDIS7_Pos               _U_(23)                                              /**< (I2S_RXCTRL) Slot 7 Disabled for this Serializer Position */
#define I2S_RXCTRL_SLOTDIS7_Msk               (_U_(0x1) << I2S_RXCTRL_SLOTDIS7_Pos)                /**< (I2S_RXCTRL) Slot 7 Disabled for this Serializer Mask */
#define I2S_RXCTRL_SLOTDIS7(value)            (I2S_RXCTRL_SLOTDIS7_Msk & ((value) << I2S_RXCTRL_SLOTDIS7_Pos))
#define I2S_RXCTRL_MONO_Pos                   _U_(24)                                              /**< (I2S_RXCTRL) Mono Mode Position */
#define I2S_RXCTRL_MONO_Msk                   (_U_(0x1) << I2S_RXCTRL_MONO_Pos)                    /**< (I2S_RXCTRL) Mono Mode Mask */
#define I2S_RXCTRL_MONO(value)                (I2S_RXCTRL_MONO_Msk & ((value) << I2S_RXCTRL_MONO_Pos))
#define   I2S_RXCTRL_MONO_STEREO_Val          _U_(0x0)                                             /**< (I2S_RXCTRL) Normal mode  */
#define   I2S_RXCTRL_MONO_MONO_Val            _U_(0x1)                                             /**< (I2S_RXCTRL) Left channel data is duplicated to right channel  */
#define I2S_RXCTRL_MONO_STEREO                (I2S_RXCTRL_MONO_STEREO_Val << I2S_RXCTRL_MONO_Pos)  /**< (I2S_RXCTRL) Normal mode Position  */
#define I2S_RXCTRL_MONO_MONO                  (I2S_RXCTRL_MONO_MONO_Val << I2S_RXCTRL_MONO_Pos)    /**< (I2S_RXCTRL) Left channel data is duplicated to right channel Position  */
#define I2S_RXCTRL_DMA_Pos                    _U_(25)                                              /**< (I2S_RXCTRL) Single or Multiple DMA Channels Position */
#define I2S_RXCTRL_DMA_Msk                    (_U_(0x1) << I2S_RXCTRL_DMA_Pos)                     /**< (I2S_RXCTRL) Single or Multiple DMA Channels Mask */
#define I2S_RXCTRL_DMA(value)                 (I2S_RXCTRL_DMA_Msk & ((value) << I2S_RXCTRL_DMA_Pos))
#define   I2S_RXCTRL_DMA_SINGLE_Val           _U_(0x0)                                             /**< (I2S_RXCTRL) Single DMA channel  */
#define   I2S_RXCTRL_DMA_MULTIPLE_Val         _U_(0x1)                                             /**< (I2S_RXCTRL) One DMA channel per data channel  */
#define I2S_RXCTRL_DMA_SINGLE                 (I2S_RXCTRL_DMA_SINGLE_Val << I2S_RXCTRL_DMA_Pos)    /**< (I2S_RXCTRL) Single DMA channel Position  */
#define I2S_RXCTRL_DMA_MULTIPLE               (I2S_RXCTRL_DMA_MULTIPLE_Val << I2S_RXCTRL_DMA_Pos)  /**< (I2S_RXCTRL) One DMA channel per data channel Position  */
#define I2S_RXCTRL_RXLOOP_Pos                 _U_(26)                                              /**< (I2S_RXCTRL) Loop-back Test Mode Position */
#define I2S_RXCTRL_RXLOOP_Msk                 (_U_(0x1) << I2S_RXCTRL_RXLOOP_Pos)                  /**< (I2S_RXCTRL) Loop-back Test Mode Mask */
#define I2S_RXCTRL_RXLOOP(value)              (I2S_RXCTRL_RXLOOP_Msk & ((value) << I2S_RXCTRL_RXLOOP_Pos))
#define I2S_RXCTRL_Msk                        _U_(0x07FFF7A3)                                      /**< (I2S_RXCTRL) Register Mask  */

#define I2S_RXCTRL_SLOTDIS_Pos                _U_(16)                                              /**< (I2S_RXCTRL Position) Slot x Disabled for this Serializer */
#define I2S_RXCTRL_SLOTDIS_Msk                (_U_(0xFF) << I2S_RXCTRL_SLOTDIS_Pos)                /**< (I2S_RXCTRL Mask) SLOTDIS */
#define I2S_RXCTRL_SLOTDIS(value)             (I2S_RXCTRL_SLOTDIS_Msk & ((value) << I2S_RXCTRL_SLOTDIS_Pos)) 

/* -------- I2S_TXDATA : (I2S Offset: 0x30) ( /W 32) Tx Data -------- */
#define I2S_TXDATA_RESETVALUE                 _U_(0x00)                                            /**<  (I2S_TXDATA) Tx Data  Reset Value */

#define I2S_TXDATA_DATA_Pos                   _U_(0)                                               /**< (I2S_TXDATA) Sample Data Position */
#define I2S_TXDATA_DATA_Msk                   (_U_(0xFFFFFFFF) << I2S_TXDATA_DATA_Pos)             /**< (I2S_TXDATA) Sample Data Mask */
#define I2S_TXDATA_DATA(value)                (I2S_TXDATA_DATA_Msk & ((value) << I2S_TXDATA_DATA_Pos))
#define I2S_TXDATA_Msk                        _U_(0xFFFFFFFF)                                      /**< (I2S_TXDATA) Register Mask  */


